Repository: roidayan/digitalboard
Catalog: translation/digital-board-*.po
Languages: he_il

source: Digital Board
he_il: מסך דיגיטלי

source: Soul Settings
he_il: הגדרות לנשמות

source: Screens
he_il: מסכים

source: Messages
he_il: הודעות

source: Souls
he_il: נשמות

source: Next Memorial Day
he_il: יום זיכרון הבא

source: Memorial Day
he_il: יום זיכרון

source: Use image provider
he_il: השתמש בספק תמונות

source: No Messages
he_il: אין הודעות

source: New Screen
he_il: מסך חדש

source: New Message
he_il: הודעה חדשה

source: Invalid memorial day
he_il: תאריך זיכרון לא חוקי

source: New Soul
he_il: נשמה חדשה

source: Create holiday messages
he_il: צור הודעות עבור החגים

source: Cycle messages interval
he_il: זמן מחזורי בין הודעות

source: Heartbeat interval
he_il: זמן מחזורי לעדכון

source: In seconds
he_il: בשניות
